read_liberty toy.lib
read_verilog test.v
link_design top
read_sdc test.sdc
report_checks
